# SetWidth

## Description
Set width of the passed object.

```pascal
PROCEDURE SetWidth(
				h     : HANDLE;
				value : REAL);
```

```python

def vs.SetWidth(h, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|
|value|REAL|The new width of the object.|

## Version
Availability: from Vectorworks 2009
## Category
* Object Info